import * as Yup from 'yup';

const validationSchema = Yup.object({
  name: Yup.string()
    .required('Ім\'я є обов\'язковим')
    .min(3, 'Ім\'я повинно містити мінімум 3 символи')
    .matches(/^[A-zА-яїЇіІєЄґҐ]+$/, 'Ім\'я повинно містити лише літери'),
  email: Yup.string()
    .email('Невірний формат електронної пошти')
    .required('Електронна пошта є обов\'язковою')
    .matches(/^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/, 'Невірний формат електронної пошти. Перед і після символу "@" повинно бути мінімум 3 символи. Після крапки повинно бути мінімум 2 літери'),
  password: Yup.string()
    .min(6, 'Пароль має бути не менше 6 символів')
    .required('Пароль є обов\'язковим')
    .matches(/^(?=.*[A-Z])(?=.*\d)/, 'Пароль має містити лише англійські букви, принаймні одну велику літеру і принаймні одну цифру'),
});

export default validationSchema;